# -*- org-export-with-todo-keywords: nil; org-export-use-babel: t; org-edit-src-content-indentation: 2; org-src-preserve-indentation: nil; org-babel-results-keyword: "results"; org-image-actual-width: 1100; org-make-toc-insert-custom-ids: t; org-pandoc-format-extensions: (markdown_github+pipe_tables+raw_html); -*-
#+PROPERTY: HEADER-ARGS                 :eval never-export
#+PROPERTY: HEADER-ARGS:shell           :shebang /bin/bash :prologue "echo '# OUTPUT:'"
#+PROPERTY: HEADER-ARGS:jupyter-python  :session 20241230--07--ether--spikes
#+EXPORT_FILE_NAME: README
#+OPTIONS: toc:nil
#+OPTIONS: tags:nil

* SECTION Test summary                                              :noipynb:
  :PROPERTIES:
  :CUSTOM_ID: test-summary
  :END:

*Test group:* =20250210_gh712_peak_jitter= Testing peak jitter calculation.

*Test:* =07--ether--spikes= Ethernet, short simulated load spikes.

*Date:*

#+begin_src shell :results drawer :exports results :prologue ""
  date "+%a %d %b %Y"
#+end_src

#+results:
:results:
Sat 15 Feb 2025
:end:

*Artifacts:*

| *name*        | *link*            |
|---------------+-------------------|
| receiver dump | [[file:roc_recv.csv.xz][=roc_recv.csv.xz=]] |
| receiver log  | [[file:roc_recv.log.xz][=roc_recv.log.xz=]] |

*Jupyter notebook:*

[[file:README.ipynb][=README.ipynb=]]

** Software info

- *git revisions*

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd roc-toolkit && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit 62100a71dc06c20b94304110e6d228083fdd8125
   : Author: Victor Gaydov <victor@enise.org>
   : 
   :     chore: Use nanoseconds for all jitter entries in dump

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd csvplotter && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit e8afcd190cda52198cc13a89cad7479e2ae5bba6
   : Author: Victor Gaydov <victor@enise.org>
   : 
   :     "Decimation"

- *roc-toolkit version*

   #+begin_src shell :results verbatim :exports both
     roc-recv --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-recv 0.4.0 (f725325e26)

   #+begin_src shell :results verbatim :exports both
     ssh ubuntu@raspberrypi-4b-ubuntu.eth ./roc/roc-send --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-send 0.4.0 (f725325e26)

** Precheck

- *ping*

   #+begin_src shell :results verbatim :exports both
     ping -q -i 0.002 -c 1000 raspberrypi-4b-ubuntu.eth
   #+end_src

   #+results:
   : # OUTPUT:
   : PING raspberrypi-4b-ubuntu.eth (192.168.3.142) 56(84) bytes of data.
   : 
   : --- raspberrypi-4b-ubuntu.eth ping statistics ---
   : 1000 packets transmitted, 1000 received, 0% packet loss, time 1996ms
   : rtt min/avg/max/mdev = 0.113/0.134/0.274/0.019 ms

* SECTION Library code
  :PROPERTIES:
  :CUSTOM_ID: library-code
  :END:

#+begin_export markdown
<details>
  <summary>Click to expand</summary>
#+end_export

#+transclude: [[file:../library.py]]  :src jupyter-python :rest ":results none"

#+begin_export markdown
</details>
#+end_export

#+begin_src jupyter-python :exports both
  data = load_csv('roc_recv.csv')
  data.keys()
#+end_src

#+results:
: dict_keys(['m', 'd', 't', 'f'])

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('jitter', data['m'][:,2]/1e6),
                stats_table('peak-jitter', data['m'][:,3]/1e6))
#+end_src

#+results:
|       | *jitter*  | *peak-jitter* |
|-------+-----------+---------------|
| *min* | 3.978 ms  | 3.978 ms      |
| *max* | 16.334 ms | 6.004 ms      |
| *avg* | 5.304 ms  | 5.974 ms      |
| *p95* | 5.799 ms  | 6.004 ms      |

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('niq-latency', data['t'][:,1]/44100*1e3),
                stats_table('target-latency', data['t'][:,2]/44100*1e3))
#+end_src

#+results:
|       | *niq-latency* | *target-latency* |
|-------+---------------+------------------|
| *min* | 113.696 ms    | 137.279 ms       |
| *max* | 229.070 ms    | 217.687 ms       |
| *avg* | 145.013 ms    | 143.005 ms       |
| *p95* | 204.862 ms    | 172.880 ms       |

  :PROPERTIES:
  :CUSTOM_ID: depacketizer
  :END:

